Билет08/Documents/Бюджет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>Бюджет</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Бюджет</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПериодНачало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодКонец</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокСтатейЗатрат</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтатьяЗатрат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВозможноеПревышение</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Билет08/AccumulationRegisters/Бюджет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>Бюджет</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>План</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПланПревышение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Факт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Билет08/Documents/Бюджет/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	// регистр Бюджет 
	Движения.Бюджет.Очистить();
	Движения.Бюджет.БлокироватьДляИзменения	= Истина;
	Движения.Бюджет.Записывать = Истина;

	ДоляБюджетаПоМесяцам	= Новый Соответствие;
	
	НачалоТекущегоПериода	= ПериодНачало;
	ДнейЗаВесьПериод		= (ПериодКонец - ПериодНачало)/86400 + 1;
	Пока НачалоТекущегоПериода < ПериодКонец Цикл
	    КонецТекущегоПериода	= Мин(КонецМесяца(НачалоТекущегоПериода), КонецДня(ПериодКонец));
		
		ДнейВТекущемПериоде		= (КонецТекущегоПериода - НачалоТекущегоПериода + 1) / 86400;
		ДоляБюджетаПоМесяцам.Вставить(НачалоМесяца(НачалоТекущегоПериода), ДнейВТекущемПериоде/ДнейЗаВесьПериод);
		
		НачалоТекущегоПериода	= КонецТекущегоПериода	+1;
	КонецЦикла;	
	
	Для Каждого СтЗатрат Из СписокСтатейЗатрат Цикл
		План		= 0;
		Превышение	= 0;
		Для каждого ДоляБюджетаМес Из ДоляБюджетаПоМесяцам Цикл
			Движение = Движения.Бюджет.Добавить();
			Движение.Период = ДоляБюджетаМес.Ключ;
			Движение.Подразделение = Подразделение;
			Движение.СтатьяЗатрат = СтЗатрат.СтатьяЗатрат;
			Движение.План = СтЗатрат.Сумма * ДоляБюджетаМес.Значение;
			Движение.ПланПревышение = СтЗатрат.ВозможноеПревышение * ДоляБюджетаМес.Значение;
			
			План		= План + Движение.План;
			Превышение	= Превышение + Движение.ПланПревышение;
		КонецЦикла; 
		
		Если План <> СтЗатрат.Сумма Тогда
			Движение.План = Движение.План - (План - СтЗатрат.Сумма);
		КонецЕсли;
		Если Превышение <> СтЗатрат.ВозможноеПревышение Тогда
			Движение.ПланПревышение = Движение.ПланПревышение - (Превышение - СтЗатрат.ВозможноеПревышение);
		КонецЕсли;
	КонецЦикла;
	

КонецПроцедуры
